In [ ]:
#Exp no: 7
#Aim : Perform a simple linear regression

In [ ]:
#Name:Om M. Kadu
#Rollno:27
#Sec:B
#Subject:Emerging Tech Lab-1

In [10]:
import pandas as pd

In [11]:
import os

In [12]:
os.getcwd()

'C:\\Users\\USER\\OneDrive\\Desktop'

In [13]:
os.chdir("C:\\Users\\USER\\OneDrive\\Desktop")

In [14]:
data=pd.read_csv("Salary_Data.csv")

In [16]:
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [18]:
data.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [23]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [24]:
data.size

60

In [25]:
data.shape

(30, 2)

In [26]:
data.ndim

2

In [31]:
data.mean()

YearsExperience        5.313333
Salary             76003.000000
dtype: float64

In [32]:
data.median()

YearsExperience        4.7
Salary             65237.0
dtype: float64

In [34]:
data.columns

Index(['YearsExperience', 'Salary'], dtype='object')

# dependent and independent variable

In [38]:
x=data.drop('Salary',axis=1)

In [44]:
x.head()

   YearsExperience
0              1.1
1              1.3
2              1.5
3              2.0
4              2.2

In [45]:
y=data.Salary

In [46]:
y.head()

0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
Name: Salary, dtype: float64

In [1]:
import matplotlib.pyplot as plt
x=[1,2,3,4,5]
y=[10,20,15,30]
plt.Bar(x,y)

AttributeError: module 'matplotlib.pyplot' has no attribute 'Bar'